; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 9182)
	(= (fuel plane1) 3097)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city5)
	(= (capacity plane2) 11302)
	(= (fuel plane2) 1686)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 17)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city5)
	(= (capacity plane3) 8589)
	(= (fuel plane3) 419)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city3)
	(= (capacity plane4) 12844)
	(= (fuel plane4) 1045)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 17)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 8)
	(at plane5 city3)
	(= (capacity plane5) 6642)
	(= (fuel plane5) 2953)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 9)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city5)
	(at person2 city3)
	(at person3 city2)
	(at person4 city0)
	(at person5 city4)
	(at person6 city4)
	(at person7 city3)
	(at person8 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 664)
	(= (distance city0 city2) 591)
	(= (distance city0 city3) 682)
	(= (distance city0 city4) 615)
	(= (distance city0 city5) 961)
	(= (distance city1 city0) 664)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 803)
	(= (distance city1 city3) 802)
	(= (distance city1 city4) 522)
	(= (distance city1 city5) 580)
	(= (distance city2 city0) 591)
	(= (distance city2 city1) 803)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 515)
	(= (distance city2 city4) 743)
	(= (distance city2 city5) 646)
	(= (distance city3 city0) 682)
	(= (distance city3 city1) 802)
	(= (distance city3 city2) 515)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 702)
	(= (distance city3 city5) 504)
	(= (distance city4 city0) 615)
	(= (distance city4 city1) 522)
	(= (distance city4 city2) 743)
	(= (distance city4 city3) 702)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 533)
	(= (distance city5 city0) 961)
	(= (distance city5 city1) 580)
	(= (distance city5 city2) 646)
	(= (distance city5 city3) 504)
	(= (distance city5 city4) 533)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city3)
	(at person3 city3)
	(at person4 city1)
	(at person5 city3)
	(at person6 city1)
	(at person7 city1)
	(at person8 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person7 plane5 city3)
   deleted: (at person7 city3)
   added: (in person7 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 8
2. (fly plane1 city3 city5)
   deleted: (at plane1 city3)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 0 to 2016, (fuel plane1) from 3097 to 1081
   goals met: 2 of 8
3. (refuel plane2 city5)
   changed: (fuel plane2) from 1686 to 11302
   goals met: 2 of 8
4. (board person1 plane2 city5)
   deleted: (at person1 city5)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 8
5. (fly plane2 city5 city0)
   deleted: (at plane2 city5)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 2016 to 6821, (fuel plane2) from 11302 to 6497
   goals met: 2 of 8
6. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 8
7. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 8
8. (fly plane5 city3 city1)
   deleted: (at plane5 city3)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 6821 to 9227, (fuel plane5) from 2953 to 547
   goals met: 3 of 8
9. (debark person7 plane5 city1)
   deleted: (in person7 plane5)
   added: (at person7 city1)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 8
10. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 9227 to 12302, (fuel plane2) from 6497 to 3422
   goals met: 4 of 8
11. (refuel plane2 city4)
   changed: (fuel plane2) from 3422 to 11302
   goals met: 4 of 8
12. (board person5 plane2 city4)
   deleted: (at person5 city4)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 8
13. (board person6 plane2 city4)
   deleted: (at person6 city4)
   added: (in person6 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 4 of 8
14. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 12302 to 14912, (fuel plane2) from 11302 to 8692
   goals met: 4 of 8
15. (debark person4 plane2 city1)
   deleted: (in person4 plane2)
   added: (at person4 city1)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 8
16. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 8
17. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 14912 to 18927, (fuel plane2) from 8692 to 4677
   goals met: 6 of 8
18. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 8
19. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 18927 to 21502, (fuel plane2) from 4677 to 2102
   goals met: 6 of 8
20. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 8
21. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
